Repository: Chiheisen/clifm
Catalog: translations/*/clifm.po
Languages: spanish

source: When dealing with filenames containing spaces, you can use both single and double quotes (ex: "this file" or 'this file') plus escape sequences (ex: this\ file).
spanish: Cuando se trata de nombres de archivo que contienen espacios, puedes usar tanto comillas dobles como simples (ej: "este archivo" o 'este archivo'), además de secuencias de Escape (ej: este\ archivo).

source: %s%sfile name%s%s: Other-writable and NOT sticky directory*
spanish: %s%snombre%s%s: Directorio grabable por otros y NO sticky*

source: %s%sfile name%s%s: SGID file
spanish: %s%snombre%s%s: archivo SGID

source: %s%sfile name%s%s: SUID file
spanish: %s%snombre%s%s: archivo SUID

source: %s%sfile name%s%s: Sticky and NOT other-writable directory*
spanish: %s%snombre%s%s: Directorio sticky y no grabable por otros*

source: %s%sfile name%s%s: Sticky and other-writable directory*
spanish: %s%snombre%s%s: Directorio sticky y grabable por otros*

source: %s%sfile name%s%s: Unknown file type
spanish: %s%snombre%s%s: Tipo de archivo desconocido

source: %d elements are now in the Selection Box
spanish: Hay %d elementos en la Caja de Selección

source: %d selected %s:
spanish: %d %s seleccionados:

source: %s Keyboard shortcuts%s%s: %s A-f%s%s: Toggle list-folders-first on/off %s C-r%s%s: Refresh the screen %s A-l%s%s: Toggle long view mode on/off %s A-m%s%s: List mountpoints %s A-b%s%s: Launch the Bookmarks Manager %s A-i%s%s: Toggle hidden files on/off %s A-s%s%s: Open the Selection Box %s A-a%s%s: Select all files in the current working directory %s A-d%s%s: Deselect all selected files %s A-r%s%s: Go to the root directory %s A-e%s%s: Go to the home directory %s A-u%s%s: Go up to the parent directory of the current working directory %s A-h/A-j%s%s: Go to the previous directory in the directory history list %s A-k%s%s: Go to the next directory in the directory history list %s F10%s%s: Open the configuration file Some (and even all) of these keybindings might not work in some terminals, though they do work fine in the Linux built-in console, xvt-like terminal emulators like Urxvt and Aterm, and xterm-like ones. %s will create HOME/.Xresources, if it doesn't already exist, for these keybindings to work correctly.
spanish: %s Atajos de teclado%s%s: %s A-f%s%s: Alterna list-folders-first on/off %s C-r%s%s: Refresca la pantalla %s A-l%s%s: Alterna modo de vista ámplia on/off %s A-m%s%s: Lista puntos de montaje disponibles %s A-b%s%s: Abre el Administrador de Bookmarks %s A-i%s%s: Alterna archivos ocultos on/off %s A-s%s%s: Abre la Caja de Selección %s A-a%s%s: Selecciona todos los archivos en el actual directorio %s A-d%s%s: Deselecciona todos los archivos seleccionados %s A-r%s%s: Cambia al directorio raíz %s A-e%s%s: Cambia al directorio home %s A-u%s%s: Cambia al directorio padre del actual directorio %s A-h/A-j%s%s: Cambia al directorio anterior en el historial %s A-k%s%s: Cambia al próximo directorio en el historial %s F10%s%s: Abre el archivo de configuración Algunos (e incluso todos) estos atajos podrían no funcionar en ciertas terminales, aunque funcionan bien en la terminal integrada de Linux, terminales tipo xvt como Urxvt y Aterm, y terminales tipo xterm. %s creará HOME/.Xresources, si no existe, para que estos atajos funcionen correctamente.

source: %s %s (%s), by %s Contact: %s
spanish: %s %s (%s), por %s Contacto: %s

source: %s file name%s%s: Block special file
spanish: %s nombre%s%s: Archivo especial de bloques

source: %s file name%s%s: Broken symbolic link
spanish: %s nombre%s%s: Enlace simbólico dañado

source: %s file name%s%s: Character special file
spanish: %s nombre%s%s: Archivo especial de caracteres

source: %s file name%s%s: Directory with no read permission
spanish: %s nombre%s%s: Directorio sin permiso de lectura

source: %s file name%s%s: Directory*
spanish: %s nombre%s%s: Directorio*

source: %s file name%s%s: EMPTY directory
spanish: %s nombre%s%s: Directorio vacío

source: %s file name%s%s: Empty (zero-lenght) file
spanish: %s nombre%s%s: Archivo vacío

source: %s file name%s%s: Empty executable file
spanish: %s nombre%s%s: Archivo ejecutable vacío

source: %s file name%s%s: Executable file
spanish: %s nombre%s%s: Archivo ejecutable

source: %s file name%s%s: File with no read permission
spanish: %s nombre%s%s: Archivo sin permiso de lectura

source: %s file name%s%s: Pipe or FIFO special file
spanish: %s nombre%s%s: Archivo especial FIFO o tubería (pipe)

source: %s file name%s%s: Regular file
spanish: %s nombre%s%s: Archivo regular

source: %s file name%s%s: Socket file
spanish: %s nombre%s%s: Archivo socket

source: %s file name%s%s: Symbolic link
spanish: %s nombre%s%s: Enlace simbólico

source: %s is a completely text-based, KISS file manager able to perform all the basic operations you may expect from any other FM. However, the most salient features of %s are: a) The use of short commands and numbers (ELN's), instead of filenames. Type 'o 12', for instance, to open a file with your default text editor or to change to the desired directory. Since numbers could be a bit tricky when it comes to listed files, you can use the TAB key to expand the filename corresponding to the required ELN. With the automatic ELN's expansion feature you can use ELN's with external commands as well. 'diff 12 5', for example, will run 'diff' over the files corresponding to ELN's 12 and 5. Ranges are also accepted, for example: rm 1-12. b) Bookmarks: bookmark your favorite directories, and even files, to get easy access to them. Example: type 'bm' (or Alt-b) to open the bookmarks screen and then simply type a number or a hotkey to access the desired bookmark. c) The Selection Box (easily accessible via the 'sb' command) allows you to select files and directories from different parts of your filesystem and then operate on them with just one command. d) The back and forth functions keep track of all the paths visited by you, so that you can go back and forth to any of them by just typing 'b' or 'f' (Alt-h, Alt-k). e) Keyboard shortcuts make it even easier and faster to navigate and operate on your files. For example, instead of typing 'cd ..' to go back to the parent directory, or 'sel *' to select all files in the current directory, you can simply press Alt-u and Alt-a respectivelly. f) The quick search function makes it really easy to quickly find the files you are looking for: just type '/search_string', that's all. g) It is blazing fast and incredibly lightweigth. With a memory footprint below 5Mb, it can run on really old hardware. h) It is so simple that it doesn't require an X session nor any graphical environment at all, being able thus to perfectly run on the linux built-in console and even on a headless machine via a SSH or a telnet session. All of these features (described in more detail below) are aimed to make easier and faster to move through and to operate on your files. Because inspired in Arch Linux and its KISS principle, %s is fundamentally aimed to be lightweight, fast, and simple. On Arch's notion of simplcity see: https://wiki.archlinux.org/index.php/Arch_Linux#Simplicity
spanish: %s es un administrador de archivos 100%% en modo texto, KISS, capaz de llevar a cabo todas la operaciones básicas que puedes esperar de cualquier otro administrador de archivos. Sin embargo, las características más representativas de %s son: a) El uso de comandos cortos y números (ELN's), en lugar de nombres de archivos. Ingresa 'o 12', por ejemplo, para abrir un archivo con tu editor de textos por defecto o para cambiar al directorio deseado. Puesto que los números pueden ser un poco " "engañosos cuando se trata de nombres de archivos, puedes usar la tecla TAB para expandir el nombre de archivo correspondiente al ELN requerido. Con la función de " "expansión automática de ELN's también puedes usar ELN's con comandos externos. 'diff 12 5', por ejemplo, ejecutará 'diff' sobre los archivos correspondientes a los ELN's 12 y 5. También se aceptan rangos de ELN's, por ejemplo: rm 1-12. b) Bookmarks: Marca tus directorios favoritos, e incluso archivos, para acceder a ellos fácilmente. Ejemplo: ingresa 'bm' (o Alt-b) para abrir la pantalla de favoritos y luego sólo ingresa un número o una tecla rápida para acceder al bookmark en cuestión. c) La Caja de Selección te permite seleccionar archivos y directorios de diferentes partes del sistema de archivos para luego operar sobre ellos con sólo un comando. d) Las funciones 'back' y 'forth' mantienen un registro de todas las rutas visitadas, de modo que puedas ir hacias atrás o hacia adelante sólo ingresando 'b' o 'f' (Alt-h, Alt-k). e) Los atajos de teclado hacen incluso más sencillo navegar y operar sobre el sistema de archivos. Por ejemplo, en lugar de tipear 'cd ..' para ir al directorio padre, o 'sel *' para seleccionar todos los archivos en el actual directorio, puedes simplemente presionar Alt-u o Alt-a respectivamente. f) La función de búsqueda rápida hace que hallar archivos sea más fácil y rápido. g) Es verdaderamente rápido y muy liviano. Pesando menos de 5Mb, puede ser ejecutado en hardware realmente antiguo. h) Es tan simple que ni siquiera necesita de una sesión X ni de entorno gráfico alguno, siendo capaz de correr perfectamente en la terminal integrada de Linux e incluso remotamente via SSH o telnet. Todas estas características (descritas abajo con más detalle) están destinadas a hacer que moverse y operar sobre tus archivos sea más sencillo y eficiente. Inspirado en Arch Linux y su principio KISS, %s ha sido diseñado para ser liviano, rápido y simple. Sobre la noción de simplicidad de Arch véase: https://wiki.archlinux.org/index.php/Arch_Linux#Simplicity

source: %s%s %s%s %s(%s), by %s
spanish: %s%s %s%s %s(%s), por %s

source: %sBookmarks Manager%s
spanish: %sAdministrador de Bookmarks%s

source: There are no bookmarks. Do you want to edit the bookmarks file? [Y/n]
spanish: No hay bookmarks. Quieres editar el archivo de bookmarks? [Y/n]

source: Choose a bookmark ([e]dit, [q]uit):
spanish: Elige un bookmark ([e] editar, [q] salir):

source: %s: !%d: event not found
spanish: %s: !%d: evento no encontrado

source: %s: !%s: event not found
spanish: %s: !%s: evento no encontrado

source: %s: %s failed to allocate %zu bytes
spanish: %s: %s error al asignar %zu bytes de memoria

source: %s: %s: '%s': Already selected
spanish: %s: %s: '%s': Ya está seleccionado

source: %s: %s: '%s': No such file or directory
spanish: %s: %s: '%s': No existe el archivo o directorio

source: %s: %s: Command not found
spanish: %s: %s: Comando no encontrado

source: %s: '%.2s': Syntax error
spanish: %s: '%.2s': Error de sintaxis

source: %s: '%c': Syntax error
spanish: %s: '%c': Error de sintaxis

source: %s: '%s -> %s' (%s): Cannot open file. Try 'application filename'.
spanish: %s: '%s -> %s' (%s): No se puede abrir el archivo. Intenta 'programa nombre_de_archivo'.

source: %s: '%s' (%s): Cannot open file. Try 'application filename'.
spanish: %s: '%s' (%s): No se puede abrir el archivo. Intenta 'programa nombre_de_archivo'.

source: %s: '%s': Command not found
spanish: %s: '%s': Commando no encontrado

source: %s: '%s': Error getting parent directory
spanish: %s: '%s': Error obteniendo directorio padre

source: %s: '%s': Is a directory
spanish: %s: '%s': Es un directorio

source: %s: '%s': Permission denied
spanish: %s: '%s': Permiso denegado

source: %s: '%s': Warning! Failure getting the home directory. Using '%s' as an emergency home
spanish: %s: '%s': Advertencia! Error obteniendo el directorio home. Usando '%s' como como directorio home de emergencia

source: %s: 'xdg-open' not found. Try 'edit application_name'
spanish: %s: 'xdg-open' no encontrado. Intenta 'edit nombre_del_programa'

source: %s: 'xdg-open' not found. Without this program you will always need to specify an application when opening files.
spanish: %s: 'xdg-open' no encontrado. Sin este programa siempre tendrás que especificar una aplicación para abrir archivos.

source: %s: Command not found
spanish: %s: Commando no encontrado

source: %s: Error getting hostname
spanish: %s: No se pudo obtener el nombre del host

source: %s: Error getting username
spanish: %s: No se pudo obtener el nombre del usuario

source: %s: Error getting variable name
spanish: %s: No se pudo obtener el nombre de la variable

source: %s: Error getting variable value
spanish: %s: No se pudo obtener el valor de la variable

source: %s: External commands %s
spanish: %s: Uso de comandos externos %s

source: %s: External commands are not allowed
spanish: %s: Los comandos externos no están permitidos

source: %s: External commands disabled
spanish: %s: Comandos externos deshabilitados

source: %s: External commands enabled
spanish: %s: Comandos externos habilitados

source: %s: Fatal error! Failed retrieving current working directory
spanish: %s: Error fatal! No se pudo obtener el actual directorio

source: %s: Folders first %s
spanish: %s: Directorios primero %s

source: %s: Hidden files %s
spanish: %s: Archivos ocultos %s

source: %s: Missing quote
spanish: %s: Comilla faltante

source: %s: No matches found
spanish: %s: No hay coincidencias

source: %s: Pager %s
spanish: %s: Paginador %s

source: %s: Pager disabled
spanish: %s: Paginador deshabilitado

source: %s: Pager enabled
spanish: %s: Paginador habilitado

source: %s: Path variable is NULL or empty
spanish: %s: La variable 'path' es NULL o está vacía

source: %s: Permission denied
spanish: %s: Permiso denegado

source: %s: Restart your %s for changes to ~/.Xresources to take effect. Otherwise, %s keybindings might not work as expected.
spanish: %s: Reinicia tu %s para que los cambios a ~/.Xresources hagan efecto. De otro modo, los atajos de teclado de %s podrían no funcionar como deben.

source: %s: There are no messages
spanish: %s: No hay mensajes

source: %s: There are no selected files
spanish: %s: No hay archivos seleccionados

source: %s: To gracefully quit type 'quit'
spanish: %s: Para salir limpiamente ingresa 'quit'

source: %s: Unicode disabled
spanish: %s: Unicode deshabilitado

source: %s: Unicode enabled
spanish: %s: Unicode habilitado

source: %s: Usage: ext [on, off, status]
spanish: %s: Uso: ext [on, off, status]

source: %s: Usage: pager [on, off, status]
spanish: %s: Uso: pager [on, off, status]

source: %s: Usage: unicode [on, off, status]
spanish: %s: Uso: unicode [on, off, status]

source: %s: fopen: '%s': %s. Using default values.
spanish: %s: fopen: '%s': %s. Usando valores por defecto.

source: %s: invalid option -- '%c' Usage: %s [-aAfFgGhiIlLoOsuUvx] [-p path] Try '%s --help' for more information.
spanish: %s: opción inválida -- '%c' Uso: %s [-aAfFgGhiIlLoOsuUvx] [-p ruta] Intenta '%s --help' para más información.

source: %s: mkdir: '%s': Error creating configuration directory
spanish: %s: mkdir: '%s': Error al crear el directorio de configuración

source: %s: mkdir: '%s': Error creating trash directory
spanish: %s: mkdir: '%s': Error al crear el directorio Trash

source: %s: open: '%s': Broken link
spanish: %s: open: '%s': Enlace dañado

source: %s: open: '%s': Command not found
spanish: %s: open: '%s': Comando no encontrado

source: %s: option requires an argument -- '%c' Try '%s --help' for more information.
spanish: %s: la opción requiere un argumento -- '%c' Intenta '%s --help' para más información.

source: %s: trash: '%d': Invalid ELN
spanish: %s: trash: '%d': ELN no válido

source: %s: trash: '%s': Error getting filename
spanish: %s: trash: '%s': Error obteniendo nombre de archivo

source: %s: trash: '%s': Error removing trashed file
spanish: %s: trash: '%s': Error eliminando archivo de la papelera

source: %s: trash: '%s': Failed copying file to Trash
spanish: %s: trash: '%s': Error copiando archivo a la papelera

source: %s: trash: '%s': Failed encoding path
spanish: %s: trash: '%s': Error codificando ruta

source: %s: trash: '%s': Failed removing file
spanish: %s: trash: '%s': Error eliminando archivo

source: %s: trash: '%s': Invalid ELN
spanish: %s: trash: '%s': ELN no válido

source: %s: trash: '%s': Unsuported file type
spanish: %s: trash: '%s': Tipo de archivo no soportado

source: %s: trash: '%s/%s': Failed removing trash file Try removing it manually
spanish: %s: trash: '%s/%s': Error eliminando archivo de la papelera Intenta eliminarlo maualmente

source: %s: trash: Error trashing %s
spanish: %s: trash: Error enviando %s a la papelera

source: %s: trash: Failed removing temporary files from Trash. Try removing them manually
spanish: %s: trash: Error eliminando archivos temporales de la papelera. Intenta eliminarlos manualmente

source: %s: undel: '%s': Failed decoding path
spanish: %s: undel: '%s': Error decodificando ruta

source: %s: undel: '%s': Failed removing info file
spanish: %s: undel: '%s': Error eliminando archivo de información

source: %s: undel: '%s': Failed restoring trashed file
spanish: %s: undel: '%s': Error restaurando archivo

source: %s: undel: '%s': No such file or directory
spanish: %s: undel: '%s': No existe el archivo o directorio

source: %s: undel: '%s': Permission denied
spanish: %s: undel: '%s': Permiso denegado

source: %s: undel: Info file for '%s' not found. Try restoring the file manually
spanish: %s: undel: Archivo de información para '%s' no encontrado. Intenta restaurar el archivo manualmente

source: %s: unknown option character '\%x'
spanish: %s: caracter de opción desconocido '\%x'

source: %s: xdg-open not found. Specify an application to open the file Usage: open ELN/filename [application] [&]
spanish: %s: xdg-open no encontrado. Especifica un programa para abrir el archivo Uso: open ELN/nombre [programa] [&]

source: %s: xdg-open not found. Try 'ELN/hot-key application'
spanish: %s: 'xdg-open' no existe. Intenta 'ELN/tecla-rápida programa'

source: %s: xdg-open not found. Try 'e application'
spanish: %s: xdg-open no existe. Intenta 'e programa'

source: %s: xdg-open not found. Try 'hotkey application'
spanish: %s: xdg-open no existe. Intenta 'tecla-rápida programa'

source: %s: xdg-open: Command not found
spanish: %s: xdg-open: Comando no encontrado

source: %sCliFM, the anti-eye-candy, KISS file manager%s
spanish: %sCliFM, el administrador de archivos KISS, anti-careta%s

source: The anti-eye-candy/KISS file manager %s
spanish: El administrador de archivos KISS, anti-careta %s

source: Press any key to continue...
spanish: Presiona cualquier tecla para continuar...

source: %sCommands: %s%sNote: ELN = Element List Number. Example: In the line "12 openbox", 12 is the ELN corresponding to the 'openbox' file. %s
spanish: %sComandos: %s%sNota: ELN = Número de lista de elemento. Ejemplo: En la línea "12 openbox", 12 es el ELN correspondiente al archivo 'openbox'. %s

source: %sLog file%s%s: ~/.config/%s/log.cfm
spanish: %sArchivo de logs%s%s: ~/.config/%s/log.cfm

source: %sMessages log file%s%s: ~/.config/%s/messages.cfm
spanish: %sArchivo de mensajes%s%s: ~/.config/%s/messages.cfm

source: %sMountpoints%s
spanish: %sPuntos de montaje%s

source: %sSelection Box%s%s
spanish: %sCaja de Selección%s%s

source: %sTrashed files%s%s
spanish: %sArchivos en la papelera%s%s

source: '%s': Directory is immutable
spanish: '%s': El directorio es inmutable

source: '%s': File is immutable
spanish: '%s': El archivo es inmutable

source: '%s': No such file or directory
spanish: '%s': No existe el archivo o el directorio

source: '%s': Permission denied
spanish: '%s': Permiso denegado

source: ('du': not found)
spanish: ('du': no encontrado)

source: A bold green asterisk at the left of the prompt indicates that there are elements in the Selection Box. In the same way, a yellow 'T' notices that there are currently files in the trash can. Finally, %s makes use of three kind of messages: errors (a red 'E' at the left of the prompt), warnings (a yellow 'W'), and simple notices (a green 'N').
spanish: Un asterisco verde en negrita a la izquierda del prompt indica que hay elementos en la Caja de Selección. De la misma manera, una 'T' amarilla dice que hay archivos en la papelera de reciclaje. Finalmente, %s hace uso de tres tipos de mensajes: errores (una 'E' roja a la izquierda del prompt), advertencias (una 'W' amarilla), y simples mensajes (una 'N' verde).

source: A file containing a list of system messages, either errors, warnings, or simple notices. The messages log format is: [date] message.
spanish: Este archivo contiene la lista de mensajes del sistema, ya sean errores, advertencias, o simples mensajes. El formato de estos logs es: [fecha] mensaje.

source: Elements to be removed (ex: 1 2 6, or *)?
spanish: Elementos a eliminar (ej: 1 2 6, o *)?

source: Empty
spanish: Vacía

source: Here you can permanently set up %s options, add aliases and some prompt commands (which will be executed immediately before each new prompt line). Just recall that in order to use prompt commands you must allow the use of external commands. See the 'ext' command above.
spanish: Aquí puedes configurar permanentemente las opciones de %s, agregar aliases y algunos comandos prompt (que serán ejecutados inmediatamente antes de cada nuevo prompt). Sólo recuerda que para usar comandos prompt debes habilitar el uso de comandos externos. Véase el comando 'ext' arriba.

source: In this file you can add those commands you want to be executed at startup. You can also permanently set here some custom variables, ex: 'dir="/path/to/folder"'. This variable may be used as a shorcut to that folder, for instance: 'cd $dir'. Custom variables could also be temporarily defined via the command prompt: Ex: user@hostname ~ $ var="This is a test". Temporary variables will be removed at program exit.
spanish: En este archivo puedes agregar aquellos comandos que quieres que se ejecuten al comienzo del programa. También puedes especificar aquí algunas variables personalizadas, ej: 'dir="/ruta/al/directorio"'. Esta variable puede ser usada como un atajo a otro directorio, por ejemplo: 'cd $dir'. Las variables personalidas también pueden definirse temporalmente en la línea de comandos: Ej: usuario@hostname ~ $ var="Esto es una prueba". Las variables temporales serán eliminadas al finalizar el programa.

source: Press any key to continue...
spanish: Presiona cualquier tecla para continuar...

source: Text editor:
spanish: Editor de texto:

source: This file contains a series of fields separated by a colon in the following way: 'date:user:cwd:cmd. All commands executed as external will be logged.
spanish: Este archivo contiene una serie de campos separados por dos puntos (:) de la siguiente manera: 'fecha:usuario:cwd:cmd. Todos los comandos externos serán registrados aquí.

source: %sType 'help' or '?' for instructions.%s
spanish: %sIngresa 'help' o '?' para más información.%s

source: Usage: !!: Execute the last command. !n: Execute the command number 'n' in the history list. !-n: Execute the last-n command in the history list.
spanish: Uso: !!: Ejecuta el último comando. !n: Ejecuta el comando número 'n' en el historial. !-n: Ejecuta el último-n comando en el historial.

source: Usage: back [h, hist] [clear] [!ELN]
spanish: Uso: back [h, hist] [clear] [!ELN]

source: Usage: cd [ELN/directory]
spanish: Uso: cd [ELN/directorio]

source: Usage: folders first [on, off, status]
spanish: Uso: folders first [on, off, status]

source: Usage: forth [h, hist] [clear] [!ELN]
spanish: Uso: forth [h, hist] [clear] [!ELN]

source: Usage: hidden [on, off, status]
spanish: Uso: hidden [on, off, status]

source: Usage: hidden [on, off, status]
spanish: Uso: hidden [on, off, status]

source: Usage: history [clean] [-n]
spanish: Uso: history [clean] [-n]

source: Usage: open ELN/filename [application] [&]
spanish: Uso: open ELN/nombre [programa] [&]

source: Usage: pr [ELN/filename(s)] [a, all] [s, size]
spanish: Uso: pr [ELN/nombre(s)] [a, all] [s, size]
