Repository: Chiheisen/clifm
Catalog: translations/*/clifm.po
Languages: spanish

source: Usage: sel [ELN ELN-ELN filename path... n]
spanish: Uso: sel [ELN ELN-ELN nombre ruta... n]

source: Usage: trash ELN/filename... [ls, list] [clean] [del, rm]
spanish: Uso: trash ELN/nombre... [ls, list] [clean] [del, rm]

source: Usage: undel
spanish: Uso: undel

source: You can use the exclamation character (!) to perform some history commands: !!: Execute the last command. !n: Execute the command number 'n' in the history list. !-n: Execute the last-n command in the history list.
spanish: Puedes utilizar el signo de exclamación (!) para ejecutar algunos comandos sobre el historial: !!: Ejecuta el último comando. !n: Ejecuta el comando número 'n' en el historial. !-n: Ejecuta el comando último-n en el historial.

source: bookmarks: %d: No such bookmark
spanish: bookmarks: %d: Este bookmark no existe

source: bookmarks: %s: Application not found
spanish: bookmarks: %s: Programa no encontrado

source: bookmarks: %s: No such bookmark
spanish: bookmarks: %s: Este bookmark no existe

source: bookmarks: '%s': Application not found
spanish: bookmarks: '%s': Programa no encontrado

source: bookmarks: '%s': Cannot open file
spanish: bookmarks: '%s': No se puede abrir el archivo

source: bookmarks: '%s': Wrong answer
spanish: bookmarks: '%s': Respuesta incorrecta

source: desel: '%s': Invalid element
spanish: desel: '%s': Elemento no válido

source: desel: There are no selected files
spanish: desel: No hay archivos seleccionados

source: enabled
spanish: habilitado

source: element
spanish: elemento

source: elements
spanish: elementos

source: disabled
spanish: deshabilitado

source: history: '%d': No such ELN
spanish: history: '%d': Este ELN no existe

source: history: Usage: b/f [hist] [clear] [!ELN]
spanish: history: Uso: b/f [hist] [clear] [!ELN]

source: mp: '%s': Invalid mountpoint
spanish: mp: '%s': Punto de montaje inválido

source: mp: There are no available mountpoints
spanish: mp: No hay puntos de montaje disponibles

source: stat: cannot access '%s': %s
spanish: stat: no se puede acceder a '%s': %s

source: trash: Cannot trash '%s'
spanish: trash: No se puede enviar '%s' a la papelera

source: trash: There are no trashed files
spanish: trash: No hay archivos en la papelera

source: trash: Use 'trash del' to remove trashed files
spanish: trash: Usa 'trash del' eliminar archivos de la papelera

source: undel: '%s': Invalid ELN
spanish: undel: '%s': ELN no válido

source: unknown
spanish: desconocido

source: Directory
spanish: Directorio

source: Symbolic link
spanish: Enlace simbólico

source: Block special file
spanish: Archivo especial de bloques

source: Character special file
spanish: Archivo especial de caracteres

source: Regular file
spanish: Archivo regular

source: Blocks: %ld
spanish: Bloques: %ld

source: IO Block: %ld
spanish: Bloque IO: %ld

source: Inode: %ld
spanish: Ínodo: %ld

source: Device: %d:%d
spanish: Dispositivo: %d:%d

source: Access: %s
spanish: Acceso: %s

source: Modify: %s
spanish: Modificación: %s

source: Change: %s
spanish: Cambio: %s

source: Birth: %s
spanish: Creación: %s

source: Total size:
spanish: Tamaño total:

source: Size: %s
spanish: Tamaño: %s

source: Elements to be deselected (ex: 1 2 6, or *)?
spanish: Elementos a deseleccionar (ej: 1 2 6, o *)?

source: Elements to be undeleted (ex: 1 2 6, or *)?
spanish: Elementos a restaurar (ej: 1 2 6, o *)?

source: X session
spanish: sesión X

source: block device
spanish: dispositivo de bloques

source: character device
spanish: dispositivo de caracteres

source: unknown file type
spanish: tipo de archivo desconocido

source: %s, 2017-19, %s This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License (version 2 or later) as published by the Free Software Foundation. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA, or visit <http://www.gnu.org/licenses/> NOTE: For more information about the meaning of 'free software' run 'fs'.
spanish: %s, 2017-19, %s Este programa es software libre; puedes redistribuirlo y/o modificarlo bajo los términos de la GNU General Public License (versión 2 o posterior) tal como está publicada por la Free Software Foundation. Este programa se distribuye con la esperanza de que será útil, pero SIN GARANTÍA ALGUNA, incluso sin la garantía implícita de la COMERCIABILIDAD o ADECUACIÓN A UN PROPÓSITO PARTICULAR. Véase la GNU General Public License para más detalles. Deberías haber recibido una copia de la GNU General Public License junto con este programa. De no ser así, escribe a la Free Software Foundation, Inc., 51 Franklin Street, Quinto piso, Boston, MA 02110-1301, USA, o visita <http://www.gnu.org/licenses/> NOTA: Para más información acerca del significado de 'software libre' ejecuta el comando 'fs'.

source: #%s profile #Write here the commands you want to be executed at startup #Ex: #echo -e "%s, the anti-eye-candy/KISS file manager"
spanish: #%s profile #Escribe aquí los comandos a ejecutar al inicio del programa #Ej: #echo -e "%s, el administrador de archivos KISS, anti-careta"

source: %s configuration file ########################
spanish: Archivo de configuración de %s #################################

source: #Default starting path is HOME
spanish: #La ruta de inicio por defecto es HOME

source: #Write below the commands you want to be executed before the prompt #Ex:
spanish: #Escribe debajo los comandos que quieras que se ejecuten antes del prompt #Ej:

source: Excerpt from 'What is Free Software?', by Richard Stallman. Source: https://www.gnu.org/philosophy/free-sw.html "'Free software' means software that respects users' freedom and community. Roughly, it means that the users have the freedom to run, copy, distribute, study, change and improve the software. Thus, 'free software' is a matter of liberty, not price. To understand the concept, you should think of 'free' as in 'free speech', not as in 'free beer'. We sometimes call it 'libre software', borrowing the French or Spanish word for 'free' as in freedom, to show we do not mean the software is gratis. We campaign for these freedoms because everyone deserves them. With these freedoms, the users (both individually and collectively) control the program and what it does for them. When users don't control the program, we call it a 'nonfree' or proprietary program. The nonfree program controls the users, and the developer controls the program; this makes the program an instrument of unjust power. A program is free software if the program's users have the four essential freedoms: - The freedom to run the program as you wish, for any purpose (freedom 0). - The freedom to study how the program works, and change it so it does your computing as you wish (freedom 1). Access to the source code is a precondition for this. - The freedom to redistribute copies so you can help your neighbor (freedom 2). - The freedom to distribute copies of your modified versions to others (freedom 3). By doing this you can give the whole community a chance to benefit from your changes. Access to the source code is a precondition for this. A program is free software if it gives users adequately all of these freedoms. Otherwise, it is nonfree. While we can distinguish various nonfree distribution schemes in terms of how far they fall short of being free, we consider them all equally unethical (...)"
spanish: Extracto de '¿Qué es software libre?', escrito por Richard Stallman. Fuente: https://www.gnu.org/philosophy/free-sw.html "'Software libre' (free software) es software que respeta tanto a la libertad de los usuarios como a la comunidad. En líneas generales, significa que los usuarios tienen la libertad de ejecutar, copiar, distribuir, estudiar, modificar y mejorar el software. En este sentido, 'software libre' es una cuestión de libertad, no de precio. Para comprender el concepto, debes pensar en 'libre' (free) como en 'discurso libre' (free speech), y no como en 'cerveza gratis' (free beer). A veces lo llamamos 'software libre' (libre software), tomando la palabra española o francesa 'libre', derivada de 'libertad' (freedom), para mostrar que no queremos decir que el software sea gratis. Luchamos por estas libertades porque todo el mundo las merece. Con estas libertades los usuarios (tanto individual como colectivamente) controlan el programa y lo que él hace por ellos. Cuando los usuarios no controlan el programa, lo llamamos 'no-libre' (nonfree) o programa propietario. El programa no-libre controla a los usuarios, y el desarrollador controla al programa; esto hace del programa un instrumento de poder injusto. Un programa es software libre si los usuarios del programa tienen las cuatro libertades esenciales: - La libertad de ejectuar el programa como quieras, para cualquier propósito (libertad 0). - La libertad de estudiar cómo funciona el programa y de modificarlo para que haga lo quieras que haga (libertad 1). El acceso al código fuente es una precondición para esto. - La libertad de redistribuir copias, para ayudar a tu vecino (libertad 2). - La libertad de distribuir copias de tus versiones modificadas a otros (libertad 3). Al hacer esto, le das a la comunidad la posibilidad de beneficiarse de tus modificaciones. El acceso al código fuente es una precondición para esto. Un programa es software libre si otorga a los usuarios adecuadamente todas estas libertades. De lo contrario, es no-libre. Mientras podemos distinguir varios esquemas de distribución no-libres, en base a cúan lejos se hayan de ser libres, los consideramos a todos ellos igualmente inmorales (...)"

source: %sfs%s%s: Print an extract from 'What is Free Software?', written by Richard Stallman.
spanish: %sfs%s%s: Muestra un extracto de '¿Qué es software libre?', escrito por Richard Stallman.

source: Besides the default TAB completion for paths, you can also expand ELN's using the TAB key. Example: 'o 12', press TAB, and it becomes 'o filename ', or, if 12 refers to a directory, 'o dir/'.
spanish: Además de la completación de paths mediante la tecla TAB, también puedes usar esta tecla para expandir ELN's. Ejemplo: 'o 12', presiona TAB, y obtienes 'o nombre_de_archivo ', o, si 12 se refiere a un directorio, 'o dir/'
