Repository: Chiheisen/clifm
Catalog: translations/*/clifm.po
Languages: spanish

source: By default, %s starts in the current working directory. However, you can always specify a different path by passing it as an argument. Ex: %s -p /home/user/misc. You can also permanently set up the starting path in the %s configuration file.
spanish: Por defecto, %s inicia en el directorio home. Sin embargo, siempre puedes especificar una ruta diferente a través de un argumento. Ej: %s -p /home/usuario/varios. También puedes establecer la ruta de inicio permanentemente en el archivo de configuración de %s.

source: %s also offers the following features: 1) Trash system 2) History function 3) TAB completion 4) TAB ELN-expansion 5) Keyboard shortcuts 6) Wildcards expansion 7) Braces expansion 8) ELN's auto-expansion 9) 'sel' keyword auto-expansion 10) Ranges auto-expansion 11) Quoted strings 12) Aliases
spanish: %s también ofrece las siguientes funciones: 1) Papelera de reciclaje 2) Historial de comandos 3) Auto-completación mediante la tecla TAB 4) Expansion de ELN's con la tecla TAB 5) Atajos de teclado 6) Auto-expansión de caracteres comodines 7) Auto-expansión de llaves 8) Auto-expansión de ELN's 9) Auto-expansión del término clave 'sel' 10) Auto-expansión de rangos 11) Cadenas de texto citadas 12) Aliases

source: %s is not limited to its own set of internal commands, like open, sel, trash, etc., but it can run any external command as well, provided external commands are allowed (use the -x option or the configuration file). By beginning the external command by a colon or a semicolon (':', ';') you tell %s not to parse the input string, but instead letting this task to the system shell, say Bash. However, bear in mind that %s is not intended to be used as a shell, but as the file manager it is.
spanish: %s no se limita a su propio conjunto de comandos internos, tales como open, sel, trash, etc., sino que además puede ejecutar comandos externos, siempre y cuando estos estén habilitados (puedes usar la opción -x o el archivo de configuración). Al comenzar un comando externo con dos puntos o punto y coma (':', ';') le dices a %s que no parsee la cadena de texto ingresada, sino que le deje esta tarea a la shell del sistema, digamos, Bash. Sin embargo, no olvides que %s no está diseñado para ser utilizado como una shell, sino como el administrador de archivos que es.

source: %s will automatically expand the 'sel' keyword: 'sel' indeed amounts to 'file1 file2 file3 ...' In this way, you can use the 'sel' keyword with any command. If you want to set the executable bit on several files, for instance, simply select the files you want and then run this command: 'chmod +x sel'. Or, if you want to copy or move several files into some directory: 'cp sel 12', or 'mv sel 12' (provided the ELN 12 corresponds to a directory), respectivelly. If the destiny directory is ommited, selected files are copied into the current working directory, that is to say, 'mv sel' amounts to 'mv sel .'. To trash or remove selected files, simply run 'tr sel' or 'rm sel' respectivelly.The same goes for wildcards and braces: 'chmod +x *', for example, will set the excutable bit on all files in the current working directory, while 'chmod +x file{1,2,3}' will do it for file1, file2, and file3 respectivelly. ELN's and ELN ranges will be also automatically expanded, provided the corresponding ELN's actually exist, that is to say, provided some filename is listed on the screen under those numbers. For example: 'diff 1 118' will only expand '1', but not '118', if there is no ELN 118. In the same way, the range 1-118 will only be expanded provided there are 118 or more elements listed on the screen. If this feature somehow conflicts with the command you want to run, say, 'chmod 644 ...', because the current amount of files is equal or larger than 644 (in which case %s will expand that number), then you can simply run the command as external: ';chmod 644...' Of course, combinations of all these features is also possbile. Example: 'cp sel file* 2 23-31 .' will copy all selected files, plus all files whose name starts with "file", plus those files corresponding to the ELN's 2 and 23 through 31, into the current working directory.
spanish: %s expandirá automáticamente la palabra clave 'sel': 'sel' de hecho significa tanto como 'archivo1 archivo2 archivo3 ...' De esta manera, puedes usar 'sel' con cualquier otro comando. Por ejemplo, si quisieras habilitar el bit ejecutable en varios archivos, sólo selecciona los archivos que quieras y luego ejecuta este comando: 'chmod +x sel'. O, si quisieras copiar o mover varios archivos a algún directorio: 'cp sel 12' o 'mv sel 12' (siempre y cuando el ELN 12 corresponda a un directorio) respectivamente. Si el directorio de destino se omite, los archivos seleccionados serán copiados al directorio actual, es decir, 'mv sel' es lo mismo que 'mv sel .'. Para enviar los archivos seleccionados a la papelera de reciclaje o para eliminarlos, sólo ejecuta 'tr sel' o 'rm sel' respectivamente. Lo mismo vale para caracteres comodines y llaves: 'chmod +x *', por ejemplo, activará el bit ejecutable en todos los archivos del directorio actual, mientras 'chmod +x file{1,2,3}' hará lo mismo para los archivos file1, file2 y file3 respectivamente. ELN's y rangos de ELN's también serán automáticamente expandidos, siempre y cuando los correspondientes ELN's existan, es decir, si algún archivo es listado en pantalla bajo esos números. Por ejemplo: 'diff 1 118' sólo expandirá '1', pero no '118', si no hay ELN 118. Del mismo modo, el rango 1-118 sólo será expandido si hay 118 or más elementos listados en la pantalla. Si esta función de alguna manera entra en conclicto con algún comando que quieras ejecutar , digamos, 'chmod 644 ...', porque la cantidad actual de archivos listados es igual o mayor a 644 (en cuyo caso %s expandirá este número), entonces puedes ejecutar el comando externamente: ';chmod ...' Por supuesto, también puedes utilizar combinaciones de estas funciones. Ejemplo: 'cp sel file* 2 23-31 .' copiará todos los archivos seleccionados, más todos aquellos cuyo nombre comience con "file", más aquellos correspondientes a los ELN's 2 y 23 hasta 31, al directorio actual.

source: %s%sEnter 'q' to quit.
spanish: %s%sIngresa 'q' para salir.

source: %s/%s%s* [dir]: This is the quick search function. Just type '/' followed by the string you are looking for (you can use wildcards), and %s will list all matches in the current working directory. To search for files in any other directory, specify the directory name as second argument. This argument (dir) could be an absolute path, a relative path, or an ELN.
spanish: %s/%s%s* [dir]: Esta es la función de búsqueda rápida. Sólo ingresa '/' seguido de la cadena de texto a buscar (puedes usar comodines), y %s listará todas las coincidencias en el actual directorio. Para buscar archivos en cualquier otro directorio, especifica el nombre del mismo como segundo argumento. Este argumento (dir) puede ser una ruta absouta o relativa, o un ELN.

source: %sColor codes:%s%s
spanish: %sCódigos de color:%s%s

source: %sConfiguration file%s%s: ~/.config/%s/%src
spanish: %sArchivo de configuración%s%s: ~/.config/%s/%src

source: %sNotes%s%s:
spanish: %sNotas%s%s:

source: %sProfile file%s%s: ~/.config/%s/%s_profile
spanish: %sArchivo de perfil%s%s: ~/.config/%s/%s_profile

source: %salias%s%s: Show aliases, if any. To write a new alias simpy type 'edit' to open the configuration file and add a line like this: alias alias_name='command_name args...'
spanish: %salias%s%s: Muestra los aliases. Para crear un nuevo alias sólo ingresa 'edit' para abrir el archivo de configuración y luego agrega una línea como esta: alias nombre_del_alias='nombre_del_comando args...'

source: %sb, back%s%s [h, hist] [clear] [!ELN]: Unlike 'cd ..', which will send you to the parent directory of the current directory, this command (with no argument) will send you back to the previously visited directory. %s keeps a record of all the visited directories. You can see this list by typing 'b hist', 'b h' or 'bh', and you can access any element in this list by simply passing the corresponding ELN in this list (preceded by the exclamation mark) to the 'back' command. Example: [user@hostname:S] ~ $ bh 1 /home/user 2 /etc 3 /proc [user@hostname:S] ~ $ b !3 [user@hostname:S] /proc $ Note: The line printed in green indicates the current position of the back function in the directory history list. Finally, you can also clear this history list by typing 'b clear'.
spanish: %sb, back%s%s [h, hist] [clear] [!ELN]: A diferencia de 'cd ..', que te envía al al directorio padre del directorio actual, este comando (sin argumentos) te enviará de nuevo al directorio previamente visitado. %s mantiene un registro de todos los directorios visitados. Puedes verlos ingreasando 'b hist', 'b h' o 'bh', y puedes acceder a cualquiera de ellos agregando el correspondiemte ELN en esta lista (precdido por un signo de exclamación) al comando 'back'. Ejemplo: [usuario@hostname:S] ~ $ bh 1 /home/usuario 2 /etc 3 /proc [usuario@hostname:S] ~ $ b !3 [usuario@hostname:S] /proc $ Nota: The línea impresa en verde indica la posición actual de la función 'back' en el historial de directorios. Por último, puedes borrar el historial ingresando 'b clear'.

source: %sbm, bookmarks%s%s: Open the bookmarks menu. Here you can add, remove or edit your bookmarks to your liking, or simply change the current directory to that specified by the corresponding bookmark by just typing either its ELN or its hotkey.
spanish: %sbm, bookmarks%s%s: Abre el menú de favoritos. Aquí puedes agregar, eliminar o editar tus favoritos a tu gusto, o simplemente cambiar el actual directorio a aquel especificado por el correspondiente bookmark ingresando su ELN o su tecla rápida.

source: %sc, l, m, md, r%s%s: short for 'cp', 'ln', 'mv', 'mkdir', and 'rm' commands respectivelly.
spanish: %sc, l, m, md, r%s%s: abreviaciones para los comandos 'cp', 'ln', 'mv', 'mkdir', y 'rm' respectivamente.

source: %scd%s%s [ELN/dir]: When used with no argument, it changes the current directory to the default directory (HOME). Otherwise, 'cd' changes the current directory to the one specified by the first argument. You can use either ELN's or a string to indicate the directory you want. Ex: 'cd 12' or 'cd ~/media'. Unlike the shell 'cd' command, %s's built-in 'cd' function doesn not only changes the current directory, but also lists its content (provided the option "cd lists automatically" is enabled, which is the default) according to a comprehensive list of color codes. By default, the output of 'cd' is much like this shell command: cd DIR && ls -A --color=auto --group-directories-first
spanish: %scd%s%s [ELN/dir]: Sin argumentos, cambia el actual directorio al directorio por defecto (HOME). De lo contrario, 'cd' cambia el actual directorio a aquel especificado por el primer argumento. Puedes usar tanto ELN's o una cadena de texto para indicar el directio deseado. Ej: 'cd 12' or 'cd ~/media'. A diferencia del comando shell 'cd', la función 'cd' integrada de %s no sólo cambia el directorio actual, sino que además lista su contenido (siempre y cuando la opción "cd lists automatically" esté habilitada, y lo está por defecto) según una comprensiva lista de códigos de color. Por defecto, el resultado de 'cd' se parece bastante a este comando shell: cd DIR && ls -A --color=auto --group-directories-first

source: %scmd, commands%s%s: Show this list of commands.
spanish: %scmd, commands%s%s: Muestra esta lista de comandos.

source: %scolors%s%s: Show the color codes used in the elements list.
spanish: %scolors%s%s: Muestra los códigos de color usados para listar archivos.

source: %sds, desel%s%s [a, all]: Deselect one or more selected elements. You can also deselect all selected elements by typing 'ds a' or 'ds all'.
spanish: %sds, desel%s%s [a, all]: Deselecciona uno o más elementos seleccionados. También puedes deseleccionar todos los elementos ingresando 'ds a' o 'ds all'.

source: %sedit%s%s: Edit the configuration file.
spanish: %sedit%s%s: Edita el archivo de configuración.

source: %sext%s%s [on/off/status]: Toggle external commands on/off.
spanish: %sext%s%s [on/off/status]: Habilita y deshabilita alternamente los comandos externos.

source: %sf, forth%s%s [h, hist] [clear] [!ELN]: It works just like the back function, but it goes forward in the history record. Of course, you can use 'f hist', 'f h', 'fh', and 'f !ELN'
spanish: %sf, forth%s%s [h, hist] [clear] [!ELN]: Funciona exactamente como la función 'back', pero se mueve hacia adelante en el historial de directorios. Por supuesto, puedes usar 'f hist', 'f h', 'fh', y 'f !ELN'

source: %sff, folders first%s%s [on/off/status]: Toggle list folders first on/off.
spanish: %sff, folders first%s%s [on/off/status]: Habilita y deshabilita alternamente la opción "listar directorios primero".

source: %shf, hidden%s%s [on/off/status]: Toggle hidden files on/off.
spanish: %shf, hidden%s%s [on/off/status]: Habilita y deshabilita alternamente la vista de archivos ocultos.

source: %shistory%s%s [clean] [-n]: With no arguments, it shows the history list. If 'clean' is passed as argument, it will delete all the entries in the history file. Finally, '-n' tells the history command to list only the last 'n' commands in the history list.
spanish: %shistory%s%s [clean] [-n]: Sin argumentos, muestra el historial de directorios. Si 'clean' se usa como argumento, eliminará todos los registros del historial. Finalmente, '-n' le dice al comando 'history' que liste sólo los últimos 'n' comandos en el historial.

source: %slicense%s%s: Display the license notice.
spanish: %slicense%s%s: Muestra la licencia del programa.

source: %slog%s%s [clean]: With no arguments, it shows the log file. If clean is passed as argument, it will delete all the logs.
spanish: %slog%s%s [clean]: Sin argumentos, muestra el archivo de logs. Si 'clean' es usado como argumento, eliminará todos los logs.

source: %smp, mountpoints%s%s: List available mountpoints and change the current working directory into the selected mountpoint.
spanish: %smp, mountpoints%s%s: Lista los puntos de montaje disponibles y cambia el actual directorio al punto de montaje seleccionado.

source: %smsg, messages%s%s [clean]: With no arguments, prints the list of messages in the current session. The 'clean' option tells %s to empty the messages list.
spanish: %smsg, messages%s%s [clean]: Sin argumentos, muestras el listado de mensajes para la actual sesión. La opción 'clean' le dice a %s que borre la lista de mensajes.

source: %so, open%s%s ELN/dir/filename [application name]: Open either a directory or a file. For example: 'o 12' or 'o filename'. By default, the 'open' function will open files with the default application associated to them (if xdg-open command is found). However, if you want to open a file with a different application, just add the application name as second argument, e.g. 'o 12 leafpad'. If you want to run the program in the background, simply add the ampersand character (&): 'o 12 &'. When it comes to directories, 'open' works just like the 'cd' command.
spanish: %so, open%s%s ELN/dir/archivo [programa]: Abre tanto un directorio como un archivo regular. Por ejemplo: 'o 12' o 'o nombre'. Por defecto, la función 'open' abrirá archivos con la aplicación asociada a ellos por defecto (si el comando 'xdg-open' se encuentra). Sin embargo, si quieres abrir un archivo con otro programa, sólo tienes que añadir el nombre del programa como segundo argumento, por ejemplo, 'o 12 leafpad'. Si quieres ejecutar el programa como proceso de fondo, sólo agrega "&": 'o 12 &'. Cuando se trata de directorios, 'open' funciona exactamente como el comando 'cd'.

source: %sp, pr, prop%s%s ELN/filename(s) [a, all] [s, size]: Print file properties of FILENAME(s). Use 'all' to list properties of all files in the current working directory, and 'size' to list their corresponding sizes.
spanish: %sp, pr, prop%s%s ELN/archivo(s) [a, all] [s, size]: Muestra las propiedades de uno o más archivos. Utiliza 'all' para listar las propiedades de todos los archivos en el directorio actual, y 'size' para listar sus correspondientes tamaños.

source: %spath, cwd%s%s: Print the current working directory.
spanish: %spath, cwd%s%s: Muestra el nombre completo del actual directorio.

source: %spg, pager%s%s [on/off/status]: Toggle the pager on/off.
spanish: %spg, pager%s%s [on/off/status]: Habilita y deshabilita alternamente el paginador.

source: %sq, quit, exit, zz%s%s: Safely quit %s.
spanish: %sq, quit, exit, zz%s%s: Termina la sesión de %s de forma segura.

source: %srf, refresh%s%s: Refresh the screen.
spanish: %srf, refresh%s%s: Refresca la pantalla.

source: %ss, sel%s%s ELN ELN-ELN filename path... n: Send one or multiple elements to the Selection Box. 'Sel' accepts individual elements, range of elements, say 1-6, filenames and paths, just as wildcards. Ex: sel 1 4-10 file* filename /path/to/filename
spanish: %ss, sel%s%s ELN ELN-ELN archivo ruta... n: Envía uno o más elementos a la Caja de Selección. 'Sel' acepta elementos individuales, rangos de elementos, por ejemplo 1-6, nombres de archivos y rutas, así como comodines. Ej: sel 1 4-10 archivo* nombre_de_archivo /ruta/al/archivo

source: %ssb, selbox%s%s: Show the elements contained in the Selection Box.
spanish: %ssb, selbox%s%s: Muestra el contenido de la Caja de Selección.

source: %ssplash%s%s: Show the splash screen.
spanish: %ssplash%s%s: Muestra la pantalla de bienvenida.

source: %st, tr, trash%s%s [ELN's, file(s)] [ls, list] [clean] [del, rm]: With no argument (or by passing the 'ls' option), it prints a list of currently trashed files. The 'clean' option removes all files from the trash can, while the 'del' option lists trashed files allowing you to remove one or more of them. The trash directory is $XDG_DATA_HOME/Trash, that is, '~/.local/share/Trash'. Since this trash system follows the freedesktop specification, it is able to handle files trashed by different Trash implementations.
spanish: %st, tr, trash%s%s [ELN's, archivo(s)] [ls, list] [clean] [del, rm]: Sin argumentos (o usando la opción 'ls'), muestra la lista de archivos en la papelera de reciclaje. La opción 'clean' elimina todos los archivos de la misma, mientras la opción 'del' lista su contenido permitiendo al usuario eliminar uno o más archivos de la papelera. El directorio de la papelera de reciclaje es $XDG_DATA_HOME/Trash, es decir, '~/.local/share/Trash'. Puesto que esta papelera cumple con la especificación de Freedesktop, es capaz de manejar archivos enviados a la papelera por diferentes implementaciones de la misma.

source: %su, undel, untrash%s%s [a, all]: Print a list of currently trashed files allowing you to choose one or more of these files to be undeleted, that is to say, restored to their original location. You can also undelete all trashed files at once using the 'a' or 'all' option.
spanish: %su, undel, untrash%s%s [a, all]: Muestra el listado de archivos en la papelera de reciclaje permitiendo al usuario elegir uno o más de ellos para ser restaurados, es decir, para devolverlos a su ubicación original. Tambien puedes restaurar todos los archivos de la papelera mediante la opción 'a' o 'all'.

source: %suc, unicode%s%s [on/off/status]: Toggle unicode on/off.
spanish: %suc, unicode%s%s [on/off/status]: Habilita y deshabilita alternamente el soporte unicode.

source: %sv, paste%s%s [sel] [destiny]: The 'paste sel' command will copy the currently selected elements, if any, into the current working directory. If you want to copy these elements into another directory, you only need to tell 'paste' where to copy these files. Ex: paste sel /path/to/directory
spanish: %sv, paste%s%s [sel] [destino]: El comando 'paste sel' copia los elementos selecciandos al direcotrio actual. Si quieres copiar estos elementos a otro directorio, sólo tienes que indicar dónde copiarlos. Ej: paste sel /ruta/al/directorio

source: %sver, version%s%s: Show %s version details.
spanish: %sver, version%s%s: Muestra los detalles de la versión de %s.

source: *The slash followed by a number (/xx) after directory names indicates the amount of files contained by the corresponding directory.
spanish: *La barra seguida de un número (/xx) luego del nombre de un directorio indica la cantidad de archivos contenidos por el directorio en cuestión.

source: Choose a mountpoint ('q' to quit):
spanish: Elige un punto de montaje ('q' para salir):

source: Command line arguments take precedence over both the configuration file and the default options, whereas the configuration file takes precedence only over default options.
spanish: Los argumentos de línea de comandos tienen precedencia tanto sobre el archivo de configuración como sobre las opciones por defecto, mientras que el archivo de configuración sólo tiene precedencia sobre las opciones por defecto.

source: It depends on the terminal emulator you use to correctly display non-ASCII characters and characters from the extended ASCII charset.
spanish: Depende del emulador de terminal en uso mostrar correctamente caracteres no ASCII o pertenecientes a la tabla ASCII extendida.

source: Press any key to exit help...
spanish: Presiona cualquier tecla para salir de la ayuda...

source: Usage: %s [-aAfFgGhiIlLoOsuUvx] [-p path] -a, --no-hidden do not show hidden files -A, --show-hidden show hidden files (default) -f, --no-folders-first do not list folders first -F, --folders-first list folders first (default) -g, --pager enable the pager -G, --no-pager disable the pager (default) -h, --help show this help and exit -i, --no-case-sensitive no case-sensitive files listing (default) -I, --case-sensitive case-sensitive files listing -l, --no-long-view disable long view mode (default) -L, --long-view enable long view mode -o, --no-list-on-the-fly 'cd' works as the shell 'cd' command -O, --list-on-the-fly 'cd' lists files on the fly (default) -p, --path /starting/path use /starting/path as %s starting path -s, --splash enable the splash screen -u, --no-unicode disable unicode -U, --unicode enable unicode to correctly list filenames containing accents, tildes, umlauts, non-latin letters, etc. This option is enabled by default for non-english locales -v, --version show version details and exit -x, --ext-cmds allow the use of external commands
spanish: Uso: %s [-aAfFgGhiIlLoOsuUvx] [-p ruta] -a, --no-hidden no mostrar archivos ocultos -A, --show-hidden mostrar archivos ocultos (default) -f, --no-folders-first no mostrar directorios primero -F, --folders-first mostrar directorios primero (default) -g, --pager habilita el paginador -G, --no-pager deshabilita el paginador (default) -h, --help muestra esta ayuda y termina el programa -i, --no-case-sensitive lista archivos sin tener en cuenta mayúsculas y minúsculas (default) -I, --case-sensitive lista teniendo en cuenta mayúsculas y minúsculas -l, --no-long-view deshabilita el modo de vista ámplia (default) -L, --long-view habilita el modo de vista ámplia -o, --no-list-on-the-fly 'cd' funciona como el comando shell 'cd' -O, --list-on-the-fly 'cd' lista archivos automáticamente (default) -p, --path /ruta/de/inicio utiliza /ruta/de/inicio como ruta de inicio de %s -s, --splash habilita la pantalla de bienvenida -u, --no-unicode deshabilita unicode -U, --unicode habilita unicode para listar correctamente nombres de archivos que contengan tilde, virgulilla, umlauts, caracteres no-latinos, etc. Esta opción está habilita por defecto en caso de localizaciones no-inglesas -v, --version muestra los detales de versión y termina el programa -x, --ext-cmds permite el uso de comandos externos
